{
    "languages_section":"JavaScript/TypeScript, C, Java, Python, C++, C#, PHP, MATLAB; Assembly, VHDL; HTML/CSS, JSON, XML; SQL, NoSQL",
    "frameworks_section":"Java EE, NodeJS, Django, React, gRPC, Sockets/WebSockets, PuppeteerJS, ROS2; MongoDB, MySQL, PostgreSQL; ExpressJS, Apache Tomcat; Docker, Kubernetes; Git/GitHub, JUnit Unit Testing; Bash, Linux, Windows Subsystem for Linux; Keil uVision, Xilinx-ISE FPGA",
    "embedded_section":"Teensy, Arduino, ARM Context-M, Pi Pico RP2040, ESP8266, ESP32, Raspberry Pi",
    
    "w1_b1": "Revamped the company's website using the MERN framework, improving user engagement for clients.",
    "w1_b2": "Designed and implemented a PostgreSQL database, migrating all spreadsheet-based data into a normalized relational schema to improve data integrity and streamline reporting",
    "w1_b3": "Developed internal GUI for fast-information lookup for Architects and Engineers",

    "w2_b1": "Developed comprehensive procedural documentation to provide a clear framework for future hires and significantly reducing the learning curve",
    "w2_b2": "Demonstrated excellent communication skills by coordinating with organizations such as Best Buy and Lululemon to provide professional experiences for {{ SCHOOL_ABBR_NAME }} students.",

    "w3_b1": "Received the highest Systems Acceptance Review score in University's history at 97%, propelling {{ SCHOOL_ABBR_NAME }} into the Top 30 among 102 teams around the world to compete in the University Rover Challenge. Improved university's ranking to 15th.",
    "w3_b2": "Implemented differential driving for the rover, optimizing controller usage and enabling more functionality.",
    "w3_b3": "Developed a React frontend (with a mix of MUI and Tailwind/DaisyUI) with a Python/WebSocket backend to display Science-based sensor data as well as sending commands to Science-console on rover",
    "w3_b4": "Developed firmware for two different microcontrollers - Teensy 4.0 and the RP2040 that collected sensor data from external boards and sent to Science backend using WebSockets and Linux auto-start services.",

    "w4_b1": "Successfully launched the {{ SCHOOL_ABBR_NAME }} Chapter of {{ CLUB2_NAME }}, created the annual budget, and actively manage allocations for each project, ensuring financial efficiency and adaptability throughout the school year."
}